Merge pull request #165 from Usernode-Labs/feature-background-block-production
Feature background block production
